#!/bin/bash

# =====================================================================================
# AUTO-UPDATE
# Linux operating system update script
# =====================================================================================

# --- DEFINITON DES COULEURS ---
GREEN='\033[1;32m'
CYAN='\033[0;36m'
RED='\033[0;31m'
NC='\033[0m'  # Reset

# --- BANNIERE ---
echo -e "${GREEN}"
echo -e "  █████╗ ██╗   ██╗████████╗ ██████╗       ██╗   ██╗██████╗ ██████╗  █████╗ ████████╗███████╗"
echo -e " ██╔══██╗██║   ██║╚══██╔══╝██╔═══██╗      ██║   ██║██╔══██╗██╔══██╗██╔══██╗╚══██╔══╝██╔════╝"
echo -e " ███████║██║   ██║   ██║   ██║   ██║█████╗██║   ██║██████╔╝██║  ██║███████║   ██║   █████╗  "
echo -e " ██╔══██║██║   ██║   ██║   ██║   ██║╚════╝██║   ██║██╔═══╝ ██║  ██║██╔══██║   ██║   ██╔══╝  "
echo -e " ██║  ██║╚██████╔╝   ██║   ╚██████╔╝      ╚██████╔╝██║     ██████╔╝██║  ██║   ██║   ███████╗"
echo -e " ╚═╝  ╚═╝ ╚═════╝    ╚═╝    ╚═════╝        ╚═════╝ ╚═╝     ╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚══════╝"
echo -e "${NC}"
echo -e "${CYAN}Démarrage du script de mise à jour...${NC}"
echo -e "-----------------------------------------------------------------------------------"

# --- VERIFICATION DES DROITS ROOT ---
if [ "$EUID" -ne 0 ]; then
	echo -e "${RED}[ERREUR] Ce script doit être exécuté en ROOT.${NC}"
	echo -e "Relance avec : ${CYAN}sudo ./auto-update.sh${NC}"
	exit 1
fi

echo -e "${GREEN}[OK]${NC} Droit administrateur vérifiés."
